[
    {
        "Institution": "Purdue University",
        "class_id": "CS 10100",
        "class_name": "Digital Literacy",
        "instructor": "George B. Adams, III",
        "description": "Survey of the digital world, computers as multi-purpose machines, digital information, definition of programming, computers everywhere (the Internet of things), computers that perform simultaneous computations, how apps work, data storage and searching, databases, digital audio, graphics, video, computer networks and the Internet, the World Wide Web and Internet sharing services, network and Internet performance, real-time services, artificial intelligence, cloud computing, security, and privacy.",
        "students": [
            "Jane Doe",
            "John Doe",
            "Bob Smith"
        ]
    },
    {
        "Institution": "Purdue University",
        "class_id": "CS 15900",
        "class_name": "C Programming",
        "instructor": "Xiaojin Liu",
        "description": " Fundamental principles, concepts, and methods of programming in C, with emphasis on applications in the physical sciences and engineering. Basic problem solving and programming techniques; fundamental algorithms and data structures; and use of programming logic in solving engineering problems. Students are expected to complete assignments in a collaborative learning environment.",
        "students": [
            "John Doe",
            "Bob Smith"
        ]
    },
    {
        "Institution": "Purdue University",
        "class_id": "CS 17600",
        "class_name": "Data Engineering In Python",
        "instructor": "Tony Bergstorm",
        "description": "The course introduces students to programming fundamentals in Python, including loops, functions and different data types, and provides an introduction to data engineering including working with common data formats and learning the basics of data wrangling. Students will format, extract, clean, filter, transform, search, combine, summarize, aggregate, and visualize a diverse range of data sets. Python libraries including MatPlotLib and Pandas are used.",
        "students": [
            "Jane Doe",
            "John Doe",
            "Bob Smith"
        ]
    },
    {
        "Institution": "Purdue University",
        "class_id": "CS 17700",
        "class_name": "Programming With Multimedia Objects",
        "instructor": "Andres Bejarano",
        "description": "Introduction to computers and programming: number representations, primitive data types and operations, basic control structures, programming applets and applications using graphical user interfaces, programming for detecting events and performing actions, processing multimedia objects such as images and sounds. Throughout the course, examples are drawn from a variety of fields in the natural sciences. Not open to CS majors with a grade of C or better in CS 18000. ",
        "students": [
            "Jane Doe",
            "John Doe",
            "Bob Smith"
        ]
    },
    {
        "Institution": "Purdue University",
        "class_id": "CS 18000",
        "class_name": "Problem Solving And Object-Oriented Programming",
        "instructor": "Tony Bergstorm",
        "description": "Problem solving and algorithms, implementation of algorithms in a high level programming language, conditionals, the iterative approach and debugging, collections of data, searching and sorting, solving problems by decomposition, the object-oriented approach, subclasses of existing classes, handling exceptions that occur when the program is running, graphical user interfaces (GUIs), data stored in files, abstract data types, a glimpse at topics from other CS courses. Intended primarily for students majoring in computer sciences.",
        "students": [
            "Jane Doe",
            "John Doe",
            "Bob Smith"
        ]
    },
    {
        "Institution": "Purdue University",
        "class_id": "CS 18200",
        "class_name": "Foundations Of Computer Science",
        "instructor": "Sarah H Selke",
        "description": "Logic and proofs; sets, functions, relations, sequences and summations; number representations; counting; fundamentals of the analysis of algorithms; graphs and trees; proof techniques; recursion; Boolean logic; finite state machines; pushdown automata; computability and undecidability.",
        "students": [
            "Jane Doe",
            "John Doe",
            "Bob Smith"
        ]
    },
    {
        "Institution": "Purdue University",
        "class_id": "CS 19300",
        "class_name": "Tools",
        "instructor": "Pooja S. Mathi",
        "description": "This course is designed to introduce new Computer Science students to various programming tools which will aid them in their Computer Science classes, personal projects, and software development job experiences.",
        "students": [
            "Jane Doe",
            "John Doe",
            "Bob Smith"
        ]
    }
    ,
    {
        "Institution": "Purdue University",
        "class_id": "CS 19700",
        "class_name": "Freshman Honors Seminar",
        "instructor": "Douglas E. Comer",
        "description": "A seminar dealing with the history, context, and future of computer science. Open only to students in the Computer Sciences Honors Program. ",
        "students": [
            "Jane Doe",
            "John Doe",
            "Bob Smith"
        ]
    },
    {
        "Institution": "Purdue University",
        "class_id": "CS 19700",
        "class_name": "Freshman Honors Seminar",
        "instructor": "Douglas E. Comer",
        "description": "A seminar dealing with the history, context, and future of computer science. Open only to students in the Computer Sciences Honors Program. ",
        "students": [
            "Jane Doe",
            "John Doe",
            "Bob Smith"
        ]
    },
    {
        "Institution": "Purdue University",
        "class_id": "CS 23500",
        "class_name": "Introduction To Organizational Computing",
        "instructor": "Marta A. Crowe",
        "description": "People and organizations, decision-making, information systems, telecommunications, desktop systems, integration tools, collaboration and groupware, multimedia, authoring multimedia documents, emerging technologies.",
        "students": [
            "Jane Doe",
            "John Doe",
            "Bob Smith"
        ]
    },
    {
        "Institution": "Purdue University",
        "class_id": "CS 24000",
        "class_name": "Programming In C",
        "instructor": "Jeffrey A. Turkstra",
        "description": "The UNIX environment, C development cycle, data representation, operators, program structure, recursion, macros, C preprocessor, pointers and addresses, dynamic memory allocation, structures, unions, typedef, bit-fields, pointer/structure applications, UNIX file abstraction, file access, low-level I/O, concurrency.",
        "students": [
            "Jane Doe",
            "John Doe",
            "Bob Smith"
        ]
    },
    {
        "Institution": "Purdue University",
        "class_id": "CS 25000",
        "class_name": "Computer Architecture",
        "instructor": "George B. Adams, III",
        "description": "Digital logic: transistors, gates, and combinatorial circuits; clocks; registers and register banks; arithmetic-logic units; data representation: big-endian and little-endian integers; ones and twos complement arithmetic; signed and unsigned values; Von-Neumann architecture and bottleneck; instruction sets; RISC and CISC designs; instruction pipelines and stalls; rearranging code; memory and address spaces; physical and virtual memory; interleaving; page tables; memory caches; bus architecture; polling and interrupts; DMA; device programming; assembly language; optimizations; parallelism; data pipelining.",
        "students": [
            "Jane Doe",
            "John Doe",
            "Bob Smith"
        ]
    },
    {
        "Institution": "Purdue University",
        "class_id": "CS 25100",
        "class_name": "Data Structures And Algorithms",
        "instructor": "Susanne E. Hambrusch",
        "description": "Running time analysis of algorithms and their implementations, one-dimensional data structures, trees, heaps, additional sorting algorithms, binary search trees, hash tables, graphs, directed graphs, weighted graph algorithms, additional topics.",
        "students": [
            "Jane Doe",
            "John Doe",
            "Bob Smith"
        ]
    },
    {
        "Institution": "Purdue University",
        "class_id": "CS 25200",
        "class_name": "Systems Programming",
        "instructor": "Gustave Adolfo Junipero Rodriguez-rivera",
        "description": "Low-level programming; review of addresses, pointers, memory layout, and data representation; text, data, and bss segments; debugging and hex dumps; concurrent execution with threads and processes; address spaces; file names; descriptors and file pointers; inheritance; system calls and library functions; standard I/O and string libraries; simplified socket programming; building tools to help programmers; make and make files; shell scripts and quoting; unix tools including sed, echo, test, and find; scripting languages such as awk; version control; object and executable files (.o and a.out); symbol tables; pointers to functions; hierarchical directories; and DNS hierarchy; programming embedded systems.",
        "students": [
            "Jane Doe",
            "John Doe",
            "Bob Smith"
        ]
    },
    {
        "Institution": "Purdue University",
        "class_id": "CS 25200",
        "class_name": "Systems Programming",
        "instructor": "Gustave Adolfo Junipero Rodriguez-rivera",
        "description": "Low-level programming; review of addresses, pointers, memory layout, and data representation; text, data, and bss segments; debugging and hex dumps; concurrent execution with threads and processes; address spaces; file names; descriptors and file pointers; inheritance; system calls and library functions; standard I/O and string libraries; simplified socket programming; building tools to help programmers; make and make files; shell scripts and quoting; unix tools including sed, echo, test, and find; scripting languages such as awk; version control; object and executable files (.o and a.out); symbol tables; pointers to functions; hierarchical directories; and DNS hierarchy; programming embedded systems.",
        "students": [
            "Jane Doe",
            "John Doe",
            "Bob Smith"
        ]
    }
    
]